#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Redundant ignore_changes element

  on .terraform/modules/db/modules/db_instance/main.tf line 26, in resource "aws_db_instance" "this":
  26: resource "aws_db_instance" "this" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute latest_restorable_time is decided by the provider alone and
therefore there can be no configured value to compare with. Including this
attribute in ignore_changes has no effect. Remove the attribute from
ignore_changes to quiet this warning.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b1543f92c5397fb3]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
data.aws_availability_zones.available: Reading...
module.db.module.db_instance.data.aws_partition.current: Reading...
module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=1813475199]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-045e2073a2941e5a3]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0ce877ea3dc549fbd]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0bbadf421d9ba7083]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-07ae3feedf6adbf86]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0c9f436e891e75eb4]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-00bc479290f40aa08]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-025adafa141f5c430]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-033f63d9b7ed2003f]
module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-002750f72385f5949]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-02a8de384520d175b]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-033aba250477dcf29]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-03dbafad051f84b77]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-05c1138bcfc764596]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-02a5856553bd31056]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0a5cc4458fb5fd873]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0070052ea1ae823e8]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0386e5c2eadff773e]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=dev-vpc]
module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-07ec54632aec475cb]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0890c8b9bebb9f34f]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03373b4c21a3ce9c8]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-017244bbba4face45]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01a99034757ed83a5]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-08c247a9fb74f009a]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-03dbafad051f84b771080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-033aba250477dcf291080289494]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.aws_route.private_nat_gateway[0] has changed
  ~ resource "aws_route" "private_nat_gateway" {
        id                     = "r-rtb-033aba250477dcf291080289494"
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route_table.private[0] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-033aba250477dcf29"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-08c247a9fb74f009a"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = null
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-08c247a9fb74f009a"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "dev-vpc-private"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-03dbafad051f84b77"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-05c1138bcfc764596"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = null
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-05c1138bcfc764596"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "dev-vpc-public"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.db.random_password.master_password[0] will be created
  + resource "random_password" "master_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.security_group.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Complete PostgreSQL example security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "walrus-database-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "walrus-database"
        }
      + tags_all               = {
          + "Environment"      = "Development"
          + "Name"             = "walrus-database"
          + "TerraformManaged" = "True"
        }
      + vpc_id                 = "vpc-0b1543f92c5397fb3"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "172.16.20.0/24",
          + "172.16.21.0/24",
          + "172.16.22.0/24",
          + "172.16.1.0/24",
          + "172.16.2.0/24",
          + "172.16.3.0/24",
        ]
      + description              = "PostgreSQL access from within VPC"
      + from_port                = 5432
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/rds/instance/walrus-database/postgresql"
      + retention_in_days = 7
      + tags_all          = {
          + "Environment"      = "Development"
          + "TerraformManaged" = "True"
        }
    }

  # module.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/rds/instance/walrus-database/upgrade"
      + retention_in_days = 7
      + tags_all          = {
          + "Environment"      = "Development"
          + "TerraformManaged" = "True"
        }
    }

  # module.db.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 0
      + backup_window                         = "03:00-06:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "walrus-database"
      + db_subnet_group_name                  = "dev-vpc"
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + enabled_cloudwatch_logs_exports       = [
          + "postgresql",
          + "upgrade",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "14.1"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = false
      + id                                    = (known after apply)
      + identifier                            = "walrus-database"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t4g.small"
      + iops                                  = 0
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = "mon:00:00-mon:03:00"
      + max_allocated_storage                 = 100
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = 7
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_type                          = (known after apply)
      + tags_all                              = {
          + "Environment"      = "Development"
          + "TerraformManaged" = "True"
        }
      + timezone                              = (known after apply)
      + username                              = "admin-postgresql"
      + vpc_security_group_ids                = (known after apply)

      + timeouts {}
    }

  # module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0] will be created
  + resource "aws_iam_role" "enhanced_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Monitoring role"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "rds-monitoring-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "rds-monitoring-role"
        }
      + tags_all              = {
          + "Environment"      = "Development"
          + "Name"             = "rds-monitoring-role"
          + "TerraformManaged" = "True"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0] will be created
  + resource "aws_iam_role_policy_attachment" "enhanced_monitoring" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
      + role       = "rds-monitoring-role"
    }

  # module.db.module.db_parameter_group.aws_db_parameter_group.this[0] will be created
  + resource "aws_db_parameter_group" "this" {
      + arn         = (known after apply)
      + description = "walrus-database parameter group"
      + family      = "postgres14"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "walrus-database-"
      + tags        = {
          + "Name"      = "walrus-database"
          + "Sensitive" = "low"
        }
      + tags_all    = {
          + "Environment"      = "Development"
          + "Name"             = "walrus-database"
          + "Sensitive"        = "low"
          + "TerraformManaged" = "True"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "autovacuum"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "client_encoding"
          + value        = "utf8"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/db/modules/db_instance/main.tf line 26, in resource "aws_db_instance" "this":
  26: resource "aws_db_instance" "this" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute latest_restorable_time is decided by the provider alone and
therefore there can be no configured value to compare with. Including this
attribute in ignore_changes has no effect. Remove the attribute from
ignore_changes to quiet this warning.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @csepulveda, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*